FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/drivers/fsl_common.h
        kStatusGroup_HAL_GPIO = 121,              /*!< Group number for HAL GPIO status codes. */
        kStatusGroup_HAL_UART = 122,              /*!< Group number for HAL UART status codes. */
        kStatusGroup_HAL_TIMER = 123,             /*!< Group number for HAL TIMER status codes. */
        kStatusGroup_HAL_SPI = 124,               /*!< Group number for HAL SPI status codes. */
        kStatusGroup_HAL_I2C = 125,               /*!< Group number for HAL I2C status codes. */
        kStatusGroup_HAL_FLASH = 126,             /*!< Group number for HAL FLASH status codes. */
        kStatusGroup_HAL_PWM = 127,               /*!< Group number for HAL PWM status codes. */
        kStatusGroup_HAL_RNG = 128,               /*!< Group number for HAL RNG status codes. */
        kStatusGroup_TIMERMANAGER = 135,          /*!< Group number for TiMER MANAGER status codes. */
        kStatusGroup_SERIALMANAGER = 136,         /*!< Group number for SERIAL MANAGER status codes. */
        kStatusGroup_LED = 137,                   /*!< Group number for LED status codes. */
        kStatusGroup_BUTTON = 138,                /*!< Group number for BUTTON status codes. */
        kStatusGroup_EXTERN_EEPROM = 139,         /*!< Group number for EXTERN EEPROM status codes. */
        kStatusGroup_SHELL = 140,                 /*!< Group number for SHELL status codes. */
        kStatusGroup_MEM_MANAGER = 141,           /*!< Group number for MEM MANAGER status codes. */
        kStatusGroup_LIST = 142,                  /*!< Group number for List status codes. */
        kStatusGroup_OSA = 143,                   /*!< Group number for OSA status codes. */
        kStatusGroup_COMMON_TASK = 144,           /*!< Group number for Common task status codes. */
        kStatusGroup_MSG = 145,                   /*!< Group number for messaging status codes. */
        kStatusGroup_SDK_OCOTP = 146,             /*!< Group number for OCOTP status codes. */
        kStatusGroup_SDK_FLEXSPINOR = 147,        /*!< Group number for FLEXSPINOR status codes.*/
        kStatusGroup_CODEC = 148,                 /*!< Group number for codec status codes. */
        kStatusGroup_ASRC = 149,                  /*!< Group number for codec status ASRC. */
        kStatusGroup_OTFAD = 150,                 /*!< Group number for codec status codes. */
    };

/*! @brief Generic status return codes. */
    enum
    {
        kStatus_Success = MAKE_STATUS( kStatusGroup_Generic, 0 ),
        kStatus_Fail = MAKE_STATUS( kStatusGroup_Generic, 1 ),
        kStatus_ReadOnly = MAKE_STATUS( kStatusGroup_Generic, 2 ),
        kStatus_OutOfRange = MAKE_STATUS( kStatusGroup_Generic, 3 ),
        kStatus_InvalidArgument = MAKE_STATUS( kStatusGroup_Generic, 4 ),
        kStatus_Timeout = MAKE_STATUS( kStatusGroup_Generic, 5 ),
        kStatus_NoTransferInProgress = MAKE_STATUS( kStatusGroup_Generic, 6 ),
    };

/*! @brief Type used for all status and error return values. */
    typedef int32_t status_t;

/*
 * Macro guard for whether to use default weak IRQ implementation in drivers
 */
    #ifndef FSL_DRIVER_TRANSFER_DOUBLE_WEAK_IRQ
        #define FSL_DRIVER_TRANSFER_DOUBLE_WEAK_IRQ    1
    #endif

/*! @name Min/max macros */
/* @{ */
    #if !defined( MIN )
        #define MIN( a, b )    ( ( ( a ) < ( b ) ) ? ( a ) : ( b ) )
    #endif

    #if !defined( MAX )
        #define MAX( a, b )    ( ( ( a ) > ( b ) ) ? ( a ) : ( b ) )
    #endif
/* @} */

/*! @brief Computes the number of elements in an array. */
    #if !defined( ARRAY_SIZE )
        #define ARRAY_SIZE( x )    ( sizeof( x ) / sizeof( ( x )[ 0 ] ) )
    #endif

/*! @name UINT16_MAX/UINT32_MAX value */
/* @{ */
    #if !defined( UINT16_MAX )
        #define UINT16_MAX    ( ( uint16_t ) -1 )
    #endif

    #if !defined( UINT32_MAX )
        #define UINT32_MAX    ( ( uint32_t ) -1 )
    #endif
/* @} */

/*! @name Timer utilities */
/* @{ */
/*! Macro to convert a microsecond period to raw count value */
    #define USEC_TO_COUNT( us, clockFreqInHz )       ( uint64_t ) ( ( ( uint64_t ) ( us ) * ( clockFreqInHz ) ) / 1000000U )
/*! Macro to convert a raw count value to microsecond */
    #define COUNT_TO_USEC( count, clockFreqInHz )    ( uint64_t ) ( ( uint64_t ) count * 1000000U / clockFreqInHz )

/*! Macro to convert a millisecond period to raw count value */
    #define MSEC_TO_COUNT( ms, clockFreqInHz )       ( uint64_t ) ( ( uint64_t ) ms * clockFreqInHz / 1000U )
/*! Macro to convert a raw count value to millisecond */
    #define COUNT_TO_MSEC( count, clockFreqInHz )    ( uint64_t ) ( ( uint64_t ) count * 1000U / clockFreqInHz )
/* @} */

/*! @name Alignment variable definition macros */
/* @{ */
    #if ( defined( __ICCARM__ ) )

/**
 * Workaround to disable MISRA C message suppress warnings for IAR compiler.
 * http:/ /supp.iar.com/Support/?note=24725
 */
        _Pragma("diag_suppress=Pm120")
        #define SDK_PRAGMA( x )                  _Pragma(#x)
        _Pragma("diag_error=Pm120")
/*! Macro to define a variable with alignbytes alignment */
        #define SDK_ALIGN( var, alignbytes )     SDK_PRAGMA( data_alignment = alignbytes ) var
/*! Macro to define a variable with L1 d-cache line size alignment */
        #if defined( FSL_FEATURE_L1DCACHE_LINESIZE_BYTE )
            #define SDK_L1DCACHE_ALIGN( var )    SDK_PRAGMA( data_alignment = FSL_FEATURE_L1DCACHE_LINESIZE_BYTE ) var
        #endif
/*! Macro to define a variable with L2 cache line size alignment */
        #if defined( FSL_FEATURE_L2CACHE_LINESIZE_BYTE )
            #define SDK_L2CACHE_ALIGN( var )    SDK_PRAGMA( data_alignment = FSL_FEATURE_L2CACHE_LINESIZE_BYTE ) var
        #endif
    #elif defined( __CC_ARM ) || defined( __ARMCC_VERSION )
/*! Macro to define a variable with alignbytes alignment */
        #define SDK_ALIGN( var, alignbytes )     __attribute__( ( aligned( alignbytes ) ) ) var
/*! Macro to define a variable with L1 d-cache line size alignment */
        #if defined( FSL_FEATURE_L1DCACHE_LINESIZE_BYTE )
            #define SDK_L1DCACHE_ALIGN( var )    __attribute__( ( aligned( FSL_FEATURE_L1DCACHE_LINESIZE_BYTE ) ) ) var
        #endif
/*! Macro to define a variable with L2 cache line size alignment */
        #if defined( FSL_FEATURE_L2CACHE_LINESIZE_BYTE )
            #define SDK_L2CACHE_ALIGN( var )    __attribute__( ( aligned( FSL_FEATURE_L2CACHE_LINESIZE_BYTE ) ) ) var
        #endif
    #elif defined( __GNUC__ )
/*! Macro to define a variable with alignbytes alignment */
        #define SDK_ALIGN( var, alignbytes )     var __attribute__( ( aligned( alignbytes ) ) )
/*! Macro to define a variable with L1 d-cache line size alignment */
        #if defined( FSL_FEATURE_L1DCACHE_LINESIZE_BYTE )
            #define SDK_L1DCACHE_ALIGN( var )    var __attribute__( ( aligned( FSL_FEATURE_L1DCACHE_LINESIZE_BYTE ) ) )
        #endif
/*! Macro to define a variable with L2 cache line size alignment */
        #if defined( FSL_FEATURE_L2CACHE_LINESIZE_BYTE )
            #define SDK_L2CACHE_ALIGN( var )    var __attribute__( ( aligned( FSL_FEATURE_L2CACHE_LINESIZE_BYTE ) ) )
        #endif
    #else  /* if ( defined( __ICCARM__ ) ) */
        #error Toolchain not supported
        #define SDK_ALIGN( var, alignbytes )     var
        #if defined( FSL_FEATURE_L1DCACHE_LINESIZE_BYTE )
            #define SDK_L1DCACHE_ALIGN( var )    var
        #endif
        #if defined( FSL_FEATURE_L2CACHE_LINESIZE_BYTE )
            #define SDK_L2CACHE_ALIGN( var )     var
        #endif
    #endif /* if ( defined( __ICCARM__ ) ) */

/*! Macro to change a value to a given size aligned value */
    #define SDK_SIZEALIGN( var, alignbytes ) \
    ( ( unsigned int ) ( ( var ) + ( ( alignbytes ) - 1U ) ) & ( unsigned int ) ( ~( unsigned int ) ( ( alignbytes ) - 1U ) ) )
/* @} */

/*! @name Non-cacheable region definition macros */

/* For initialized non-zero non-cacheable variables, please using "AT_NONCACHEABLE_SECTION_INIT(var) ={xx};" or
 * "AT_NONCACHEABLE_SECTION_ALIGN_INIT(var) ={xx};" in your projects to define them, for zero-inited non-cacheable variables,
 * please using "AT_NONCACHEABLE_SECTION(var);" or "AT_NONCACHEABLE_SECTION_ALIGN(var);" to define them, these zero-inited variables
 * will be initialized to zero in system startup.
 */
/* @{ */
    #if ( defined( __ICCARM__ ) )
        #if ( ( !( defined( FSL_FEATURE_HAS_NO_NONCACHEABLE_SECTION ) && FSL_FEATURE_HAS_NO_NONCACHEABLE_SECTION ) ) && defined( FSL_FEATURE_L1ICACHE_LINESIZE_BYTE ) )
            #define AT_NONCACHEABLE_SECTION( var )                           var @"NonCacheable"
            #define AT_NONCACHEABLE_SECTION_ALIGN( var, alignbytes )         SDK_PRAGMA( data_alignment = alignbytes ) var @"NonCacheable"
            #define AT_NONCACHEABLE_SECTION_INIT( var )                      var @"NonCacheable.init"
            #define AT_NONCACHEABLE_SECTION_ALIGN_INIT( var, alignbytes )    SDK_PRAGMA( data_alignment = alignbytes ) var @"NonCacheable.init"
        #else
            #define AT_NONCACHEABLE_SECTION( var )                           var
            #define AT_NONCACHEABLE_SECTION_ALIGN( var, alignbytes )         SDK_PRAGMA( data_alignment = alignbytes ) var
            #define AT_NONCACHEABLE_SECTION_INIT( var )                      var
            #define AT_NONCACHEABLE_SECTION_ALIGN_INIT( var, alignbytes )    SDK_PRAGMA( data_alignment = alignbytes ) var
        #endif
    #elif ( defined( __CC_ARM ) || defined( __ARMCC_VERSION ) )
        #if ( ( !( defined( FSL_FEATURE_HAS_NO_NONCACHEABLE_SECTION ) && FSL_FEATURE_HAS_NO_NONCACHEABLE_SECTION ) ) && defined( FSL_FEATURE_L1ICACHE_LINESIZE_BYTE ) )
            #define AT_NONCACHEABLE_SECTION_INIT( var )    __attribute__( ( section( "NonCacheable.init" ) ) ) var
            #define AT_NONCACHEABLE_SECTION_ALIGN_INIT( var, alignbytes ) \
    __attribute__( ( section( "NonCacheable.init" ) ) ) __attribute__( ( aligned( alignbytes ) ) ) var
            #if ( defined( __CC_ARM ) )
                #define AT_NONCACHEABLE_SECTION( var )     __attribute__( ( section( "NonCacheable" ), zero_init ) ) var
                #define AT_NONCACHEABLE_SECTION_ALIGN( var, alignbytes ) \
    __attribute__( ( section( "NonCacheable" ), zero_init ) ) __attribute__( ( aligned( alignbytes ) ) ) var
            #else
                #define AT_NONCACHEABLE_SECTION( var )     __attribute__( ( section( ".bss.NonCacheable" ) ) ) var
                #define AT_NONCACHEABLE_SECTION_ALIGN( var, alignbytes ) \
    __attribute__( ( section( ".bss.NonCacheable" ) ) ) __attribute__( ( aligned( alignbytes ) ) ) var
            #endif
        #else  /* if ( ( !( defined( FSL_FEATURE_HAS_NO_NONCACHEABLE_SECTION ) && FSL_FEATURE_HAS_NO_NONCACHEABLE_SECTION ) ) && defined( FSL_FEATURE_L1ICACHE_LINESIZE_BYTE ) ) */
            #define AT_NONCACHEABLE_SECTION( var )                           var
            #define AT_NONCACHEABLE_SECTION_ALIGN( var, alignbytes )         __attribute__( ( aligned( alignbytes ) ) ) var
            #define AT_NONCACHEABLE_SECTION_INIT( var )                      var
            #define AT_NONCACHEABLE_SECTION_ALIGN_INIT( var, alignbytes )    __attribute__( ( aligned( alignbytes ) ) ) var
        #endif /* if ( ( !( defined( FSL_FEATURE_HAS_NO_NONCACHEABLE_SECTION ) && FSL_FEATURE_HAS_NO_NONCACHEABLE_SECTION ) ) && defined( FSL_FEATURE_L1ICACHE_LINESIZE_BYTE ) ) */
    #elif ( defined( __XCC__ ) )
        #define AT_NONCACHEABLE_SECTION_INIT( var )                          __attribute__( ( section( "NonCacheable.init" ) ) ) var
        #define AT_NONCACHEABLE_SECTION_ALIGN_INIT( var, alignbytes ) \
    __attribute__( ( section( "NonCacheable.init" ) ) ) var __attribute__( ( aligned( alignbytes ) ) )
        #define AT_NONCACHEABLE_SECTION( var )                               __attribute__( ( section( "NonCacheable" ) ) ) var
        #define AT_NONCACHEABLE_SECTION_ALIGN( var, alignbytes ) \
    __attribute__( ( section( "NonCacheable" ) ) ) var __attribute__( ( aligned( alignbytes ) ) )
    #elif ( defined( __GNUC__ ) )

/* For GCC, when the non-cacheable section is required, please define "__STARTUP_INITIALIZE_NONCACHEDATA"
 * in your projects to make sure the non-cacheable section variables will be initialized in system startup.
 */
        #if ( ( !( defined( FSL_FEATURE_HAS_NO_NONCACHEABLE_SECTION ) && FSL_FEATURE_HAS_NO_NONCACHEABLE_SECTION ) ) && defined( FSL_FEATURE_L1ICACHE_LINESIZE_BYTE ) )
            #define AT_NONCACHEABLE_SECTION_INIT( var )                      __attribute__( ( section( "NonCacheable.init" ) ) ) var
            #define AT_NONCACHEABLE_SECTION_ALIGN_INIT( var, alignbytes ) \
    __attribute__( ( section( "NonCacheable.init" ) ) ) var __attribute__( ( aligned( alignbytes ) ) )
            #define AT_NONCACHEABLE_SECTION( var )                           __attribute__( ( section( "NonCacheable,\"aw\",%nobits @" ) ) ) var
            #define AT_NONCACHEABLE_SECTION_ALIGN( var, alignbytes ) \
    __attribute__( ( section( "NonCacheable,\"aw\",%nobits @" ) ) ) var __attribute__( ( aligned( alignbytes ) ) )
        #else
            #define AT_NONCACHEABLE_SECTION( var )                           var
            #define AT_NONCACHEABLE_SECTION_ALIGN( var, alignbytes )         var __attribute__( ( aligned( alignbytes ) ) )
            #define AT_NONCACHEABLE_SECTION_INIT( var )                      var
            #define AT_NONCACHEABLE_SECTION_ALIGN_INIT( var, alignbytes )    var __attribute__( ( aligned( alignbytes ) ) )
        #endif /* if ( ( !( defined( FSL_FEATURE_HAS_NO_NONCACHEABLE_SECTION ) && FSL_FEATURE_HAS_NO_NONCACHEABLE_SECTION ) ) && defined( FSL_FEATURE_L1ICACHE_LINESIZE_BYTE ) ) */
    #else  /* if ( defined( __ICCARM__ ) ) */
        #error Toolchain not supported.
        #define AT_NONCACHEABLE_SECTION( var )                           var
        #define AT_NONCACHEABLE_SECTION_ALIGN( var, alignbytes )         var
        #define AT_NONCACHEABLE_SECTION_INIT( var )                      var
        #define AT_NONCACHEABLE_SECTION_ALIGN_INIT( var, alignbytes )    var
    #endif /* if ( defined( __ICCARM__ ) ) */
/* @} */

/*! @name Time sensitive region */
/* @{ */
    #if defined( FSL_SDK_DRIVER_QUICK_ACCESS_ENABLE ) && FSL_SDK_DRIVER_QUICK_ACCESS_ENABLE
        #if ( defined( __ICCARM__ ) )
            #define AT_QUICKACCESS_SECTION_CODE( func )    func @"CodeQuickAccess"
            #define AT_QUICKACCESS_SECTION_DATA( func )    func @"DataQuickAccess"
        #elif ( defined( __CC_ARM ) || defined( __ARMCC_VERSION ) )
            #define AT_QUICKACCESS_SECTION_CODE( func )    __attribute__( ( section( "CodeQuickAccess" ), __noinline__ ) ) func
            #define AT_QUICKACCESS_SECTION_DATA( func )    __attribute__( ( section( "DataQuickAccess" ) ) ) func
        #elif ( defined( __GNUC__ ) )
            #define AT_QUICKACCESS_SECTION_CODE( func )    __attribute__( ( section( "CodeQuickAccess" ), __noinline__ ) ) func
            #define AT_QUICKACCESS_SECTION_DATA( func )    __attribute__( ( section( "DataQuickAccess" ) ) ) func
        #else
            #error Toolchain not supported.
        #endif /* defined(__ICCARM__) */
    #else  /* if defined( FSL_SDK_DRIVER_QUICK_ACCESS_ENABLE ) && FSL_SDK_DRIVER_QUICK_ACCESS_ENABLE */
        #if ( defined( __ICCARM__ ) )
            #define AT_QUICKACCESS_SECTION_CODE( func )    func
            #define AT_QUICKACCESS_SECTION_DATA( func )    func
        #elif ( defined( __CC_ARM ) || defined( __ARMCC_VERSION ) )
            #define AT_QUICKACCESS_SECTION_CODE( func )    func
            #define AT_QUICKACCESS_SECTION_DATA( func )    func
        #elif ( defined( __GNUC__ ) )
            #define AT_QUICKACCESS_SECTION_CODE( func )    func
            #define AT_QUICKACCESS_SECTION_DATA( func )    func
        #else
            #error Toolchain not supported.
        #endif
    #endif /* __FSL_SDK_DRIVER_QUICK_ACCESS_ENABLE */
/* @} */

/*! @name Ram Function */
    #if ( defined( __ICCARM__ ) )
        #define RAMFUNCTION_SECTION_CODE( func )    func @"RamFunction"
    #elif ( defined( __CC_ARM ) || defined( __ARMCC_VERSION ) )
        #define RAMFUNCTION_SECTION_CODE( func )    __attribute__( ( section( "RamFunction" ) ) ) func
    #elif ( defined( __GNUC__ ) )
        #define RAMFUNCTION_SECTION_CODE( func )    __attribute__( ( section( "RamFunction" ) ) ) func
    #else
        #error Toolchain not supported.
    #endif /* defined(__ICCARM__) */
/* @} */

/*! @name Suppress fallthrough warning macro */

/* For switch case code block, if case section ends without "break;" statement, there wil be
 * fallthrough warning with compiler flag -Wextra or -Wimplicit-fallthrough=n when using armgcc.
 * To suppress this warning, "SUPPRESS_FALL_THROUGH_WARNING();" need to be added at the end of each
 * case section which misses "break;"statement.
 */
/* @{ */
    #if defined( __GNUC__ ) && !defined( __ARMCC_VERSION )
        #define SUPPRESS_FALL_THROUGH_WARNING()    __attribute__( ( fallthrough ) )
    #else
        #define SUPPRESS_FALL_THROUGH_WARNING()
    #endif
/* @} */

    #if defined( __ARMCC_VERSION ) && ( __ARMCC_VERSION >= 6010050 )
        void DefaultISR( void );
    #endif

